[{"_path":"/blog/5_essential_estate_planning_documents","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"5 Essential Estate Planning Documents Everyone Should Have","description":"Estate planning involves more than just drafting a will; it's about ensuring your wishes are respected, and your loved ones are provided for after your passing. Comprehensive estate planning can provide peace of mind knowing that your assets are distributed according to your desires and that your family's future is secure. Here are five fundamental documents that form the foundation of any robust estate plan.","_type":"markdown","_id":"content:blog:5_essential_estate_planning_documents.md","_source":"content","_file":"blog/5_essential_estate_planning_documents.md","_stem":"blog/5_essential_estate_planning_documents","_extension":"md","sitemap":{"loc":"/blog/5_essential_estate_planning_documents"}},{"_path":"/blog/6_key_compliance_metrics_corporate_governance","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"6 Key Compliance Metrics for Corporate Governance","description":"Corporate governance is the backbone of a well-regulated and compliant business environment, ensuring that businesses operate with integrity and accountability. Tracking compliance success involves understanding key compliance metrics and applying insights effectively. Notably, firms like KGW Law Firm and Hayes Hunter PC have demonstrated strong governance frameworks through robust compliance practices. In this article, we delve into six essential compliance metrics that drive effective corporate governance and provide actionable insights into tracking compliance success.","_type":"markdown","_id":"content:blog:6_key_compliance_metrics_corporate_governance.md","_source":"content","_file":"blog/6_key_compliance_metrics_corporate_governance.md","_stem":"blog/6_key_compliance_metrics_corporate_governance","_extension":"md","sitemap":{"loc":"/blog/6_key_compliance_metrics_corporate_governance"}}]